RT-Thread/rt-thread/bsp/gd32105c-eval/Libraries/GD32F10x_standard_peripheral/Include/gd32f10x_fmc.h
/*!
    \file  gd32f10x_fmc.h
    \brief definitions for the FMC

    \version 2014-12-26, V1.0.0, firmware for GD32F10x
    \version 2017-06-20, V2.0.0, firmware for GD32F10x
    \version 2018-07-31, V2.1.0, firmware for GD32F10x
*/

/*
    Copyright (c) 2018, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32F10X_FMC_H
#define GD32F10X_FMC_H

#include "gd32f10x.h"

/* FMC and option byte definition */
#define FMC                        FMC_BASE                       /*!< FMC register base address */
#define OB                         OB_BASE                        /*!< option bytes base address */

/* registers definitions */
#define FMC_WS                     REG32((FMC) + 0x00U)                          /*!< FMC wait state register */
#define FMC_KEY0                   REG32((FMC) + 0x04U)                          /*!< FMC unlock key register 0 */
#define FMC_OBKEY                  REG32((FMC) + 0x08U)                          /*!< FMC option bytes unlock key register */
#define FMC_STAT0                  REG32((FMC) + 0x0CU)                          /*!< FMC status register 0 */
#define FMC_CTL0                   REG32((FMC) + 0x10U)                          /*!< FMC control register 0 */
#define FMC_ADDR0                  REG32((FMC) + 0x14U)                          /*!< FMC address register 0 */
#define FMC_OBSTAT                 REG32((FMC) + 0x1CU)                          /*!< FMC option bytes status register */
#define FMC_WP                     REG32((FMC) + 0x20U)                          /*!< FMC erase/program protection register */
#define FMC_KEY1                   REG32((FMC) + 0x44U)                          /*!< FMC unlock key register 1 */
#define FMC_STAT1                  REG32((FMC) + 0x4CU)                          /*!< FMC status register 1 */
#define FMC_CTL1                   REG32((FMC) + 0x50U)                          /*!< FMC control register 1 */
#define FMC_ADDR1                  REG32((FMC) + 0x54U)                          /*!< FMC address register 1 */
#define FMC_WSEN                   REG32((FMC) + 0xFCU)                          /*!< FMC wait state enable register */
#define FMC_PID                    REG32((FMC) + 0x100U)                         /*!< FMC product ID register */

#define OB_SPC                     REG16((OB) + 0x00U)                           /*!< option byte security protection value */
#define OB_USER                    REG16((OB) + 0x02U)                           /*!< option byte user value*/
#define OB_WP0                     REG16((OB) + 0x08U)                           /*!< option byte write protection 0 */
#define OB_WP1                     REG16((OB) + 0x0AU)                           /*!< option byte write protection 1 */
#define OB_WP2                     REG16((OB) + 0x0CU)                           /*!< option byte write protection 2 */
#define OB_WP3                     REG16((OB) + 0x0EU)                           /*!< option byte write protection 3 */

/* bits definitions */
/* FMC_WS */
#define FMC_WS_WSCNT               BITS(0,2)                                     /*!< wait state counter */

/* FMC_KEY0 */
#define FMC_KEY0_KEY               BITS(0,31)                                    /*!< FMC_CTL0 unlock key bits */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY            BITS(0,31)                                    /*!< option bytes unlock key bits */

/* FMC_STAT0 */
#define FMC_STAT0_BUSY             BIT(0)                                        /*!< flash busy flag bit */
#define FMC_STAT0_PGERR            BIT(2)                                        /*!< flash program error flag bit */
#define FMC_STAT0_WPERR            BIT(4)                                        /*!< erase/program protection error flag bit */
#define FMC_STAT0_ENDF             BIT(5)                                        /*!< end of operation flag bit */

/* FMC_CTL0 */
#define FMC_CTL0_PG                BIT(0)                                        /*!< main flash program for bank0 command bit */
#define FMC_CTL0_PER               BIT(1)                                        /*!< main flash page erase for bank0 command bit */
#define FMC_CTL0_MER               BIT(2)                                        /*!< main flash mass erase for bank0 command bit */
#define FMC_CTL0_OBPG              BIT(4)                                        /*!< option bytes program command bit */
#define FMC_CTL0_OBER              BIT(5)                                        /*!< option bytes erase command bit */
#define FMC_CTL0_START             BIT(6)                                        /*!< send erase command to FMC bit */
#define FMC_CTL0_LK                BIT(7)                                        /*!< FMC_CTL0 lock bit */
#define FMC_CTL0_OBWEN             BIT(9)                                        /*!< option bytes erase/program enable bit */
#define FMC_CTL0_ERRIE             BIT(10)                                       /*!< error interrupt enable bit */
#define FMC_CTL0_ENDIE             BIT(12)                                       /*!< end of operation interrupt enable bit */

/* FMC_ADDR0 */
#define FMC_ADDR0_ADDR             BITS(0,31)                                    /*!< flash erase/program command address bits */

/* FMC_OBSTAT */
#define FMC_OBSTAT_OBERR           BIT(0)                                        /*!< option bytes read error bit. */
#define FMC_OBSTAT_SPC             BIT(1)                                        /*!< option bytes security protection code */
#define FMC_OBSTAT_USER            BITS(2,9)                                     /*!< store USER of option bytes block after system reset */
#define FMC_OBSTAT_DATA            BITS(10,25)                                   /*!< store DATA of option bytes block after system reset. */

/* FMC_WP */
#define FMC_WP_WP                  BITS(0,31)                                    /*!< store WP of option bytes block after system reset */

/* FMC_KEY1 */
#define FMC_KEY1_KEY               BITS(0,31)                                    /*!< FMC_CTL1 unlock key bits */

